app/controllers/home_controller.rb

SELECT * FROM "rules" WHERE ("rules"."name" = 'walmart') LIMIT 1
INSERT INTO "products" ("name", "price", "statistic_id", "created_at", "updated_at") VALUES('Handphone Tiphone 67', 0.0, 1, '2010-01-27 08:57:54', '2010-01-27 08:57:54')
INSERT INTO "statistics" ("number_of_product_extracted", "created_at", "time_added", "updated_at", "extract_time", "file_size_before_extraction", "download_time", "file_size_after_extraction", "number_of_product_should_be_extracted", "number_of_true_product_extracted", "keyword", "memory_consumption", "rule_id") VALUES(NULL, '2010-01-27 08:53:25', NULL, '2010-01-27 08:53:25', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
	def extract
		keywords = params[:keywords]
		shopname = params[:shop]

		e = Extractor.new(shopname)
		@results = e.extract_product_from_online_web(keywords)

		rule = Rule.find_by_name(shopname)

		statistic = Statistic.new
		statistic.rule_id = rule.id
		statistic.keyword = keywords
		statistic.download_time = e.download_time
		statistic.extract_time = e.extract_time
		statistic.number_of_product_extracted = e.number_of_product_extracted
		statistic.save

SELECT * FROM "rules" WHERE ("rules"."name" = 'walmart') LIMIT 1
INSERT INTO "products" ("name", "price", "statistic_id", "created_at", "updated_at") VALUES('Sony Speaker Dock/Clock Radio for iPod and iPhone', '$84.00', 7, '2010-01-28 09:42:26', '2010-01-28 09:42:26')
INSERT INTO "statistics" ("number_of_product_extracted", "created_at", "updated_at", "extract_time", "file_size_before_extraction", "download_time", "file_size_after_extraction", "number_of_product_should_be_extracted", "number_of_true_product_extracted", "keyword", "memory_consumption", "rule_id") VALUES(48, '2010-02-03 08:06:53', '2010-02-03 08:06:53', 0.242174, NULL, 5.0e-05, NULL, NULL, NULL, '', NULL, 1)
---
	def extract_offline
		filepath = DOWNLOAD_PATH + params[:filename]
		shopname = params[:shop]

		e = Extractor.new(shopname)
		@results = e.extract_product_from_offline_doc(filepath)

		rule = Rule.find_by_name(shopname)

		statistic = Statistic.new
		statistic.rule_id = rule.id
		statistic.keyword = ""
		statistic.download_time = e.download_time
		statistic.extract_time = e.extract_time
		statistic.number_of_product_extracted = e.number_of_product_extracted
		statistic.save